devdnl/dnx-rtos/src/system/drivers/ethmac/stm32f1/ethmac.c
/*=========================================================================*//**
@file    ethmac.c

@author  Daniel Zorychta

@brief   This driver support Ethernet interface.

@note    Copyright (C) 2013 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include <dnx/module.h>
#include <dnx/thread.h>
#include "ethmac_cfg.h"
#include "ethmac_def.h"
#include "stm32f10x.h"
#include "stm32_eth_driver/stm32_eth.h"

/*==============================================================================
  Local macros
==============================================================================*/
#define ETH_DMARxDesc_FrameLengthShift          16

/*==============================================================================
  Local object types
==============================================================================*/
struct eth_mem {
        ETH_DMADESCTypeDef     *DMA_tx_descriptor_tab;
        ETH_DMADESCTypeDef     *DMA_rx_descriptor_tab;
        u8_t                    tx_buffer_count;
        u8_t                    rx_buffer_count;
        bool                    rx_data_ready;
        dev_lock_t              dev_lock;
};

/*==============================================================================
  Local function prototypes
==============================================================================*/

/*==============================================================================
  Local objects
==============================================================================*/
static struct eth_mem *eth_mem;         /* required by IRQ */

/*==============================================================================
  Exported objects
==============================================================================*/

/*==============================================================================
  External objects
==============================================================================*/
extern ETH_DMADESCTypeDef *DMARxDescToGet;
extern ETH_DMADESCTypeDef *DMATxDescToSet;

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_INIT(ETHMAC, void **device_handle, u8_t major, u8_t minor)
{
        STOP_IF(!device_handle);
        UNUSED_ARG(major);
        UNUSED_ARG(minor);

        struct eth_mem *hdl = calloc(1, sizeof(struct eth_mem));
        if (!hdl) {
                return STD_RET_ERROR;
        }

        eth_mem        = hdl;
        *device_handle = hdl;

        SET_BIT(RCC->AHBENR, RCC_AHBENR_ETHMACRXEN | RCC_AHBENR_ETHMACTXEN | RCC_AHBENR_ETHMACEN);

        NVIC_EnableIRQ(ETH_IRQn);
        NVIC_SetPriority(ETH_IRQn, ETHMAC_IRQ_PRIORITY);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_RELEASE(ETHMAC, void *device_handle)
{
        STOP_IF(!device_handle);

        struct eth_mem *hdl    = device_handle;
        stdret_t        status = STD_RET_ERROR;

        critical_section_begin();

        if (device_is_unlocked(&hdl->dev_lock)) {
                free(hdl);
                eth_mem = NULL;
                ETH_DeInit();
                ETH_SoftwareReset();
                while (ETH_GetSoftwareResetStatus() == SET);
                CLEAR_BIT(RCC->AHBENR, RCC_AHBENR_ETHMACRXEN | RCC_AHBENR_ETHMACTXEN | RCC_AHBENR_ETHMACEN);
                NVIC_DisableIRQ(ETH_IRQn);

                status = STD_RET_OK;
        } else {
                errno = EBUSY;
        }

        critical_section_end();

        return status;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_OPEN(ETHMAC, void *device_handle, int flags)
{
        STOP_IF(!device_handle);
        UNUSED_ARG(flags);

        struct eth_mem *hdl = device_handle;

        if (device_lock(&hdl->dev_lock)) {
                return STD_RET_OK;
        } else {
                errno = EBUSY;
        }

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 * @param[in ]          *opened_by_task         task with opened this device (valid only if force is true)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_CLOSE(ETHMAC, void *device_handle, bool force, const task_t *opened_by_task)
{
        STOP_IF(!device_handle);
        UNUSED_ARG(opened_by_task);

        struct eth_mem *hdl = device_handle;

        if (device_is_access_granted(&hdl->dev_lock) || force) {
                device_unlock(&hdl->dev_lock, force);
                return STD_RET_OK;
        } else {
                errno = EBUSY;
        }

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 *
 * @return number of written bytes, -1 if error
 */
//==============================================================================
API_MOD_WRITE(ETHMAC, void *device_handle, const u8_t *src, size_t count, u64_t *fpos)
{
        STOP_IF(!device_handle);
        STOP_IF(!src);
        STOP_IF(!fpos);
        UNUSED_ARG(count);

        errno = EPERM;

