devdnl/dnx-rtos/src/system/drivers/ethmac/stm32f1/ethmac.c
        return 0;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 *
 * @return number of read bytes, -1 if error
 */
//==============================================================================
API_MOD_READ(ETHMAC, void *device_handle, u8_t *dst, size_t count, u64_t *fpos)
{
        STOP_IF(!device_handle);
        STOP_IF(!dst);
        STOP_IF(!fpos);
        UNUSED_ARG(count);

        errno = EPERM;

        return 0;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_IOCTL(ETHMAC, void *device_handle, int request, void *arg)
{
        STOP_IF(!device_handle);

        struct eth_mem *hdl = device_handle;

        if (device_is_access_granted(&hdl->dev_lock)) {
                switch (request) {
                case ETHMAC_IORQ_ETHERNET_INIT:
                        /* configure Ethernet */
                        ETH_DeInit();
                        ETH_SoftwareReset();
                        while (ETH_GetSoftwareResetStatus() == SET);

                        ETH_InitTypeDef ETH_InitStructure;
                        ETH_StructInit(&ETH_InitStructure);

                        /* MAC configuration */
                        ETH_InitStructure.ETH_AutoNegotiation          = ETH_AutoNegotiation_Enable;
                        ETH_InitStructure.ETH_LoopbackMode             = ETH_LoopbackMode_Disable;
                        ETH_InitStructure.ETH_RetryTransmission        = ETH_RetryTransmission_Disable;
                        ETH_InitStructure.ETH_AutomaticPadCRCStrip     = ETH_AutomaticPadCRCStrip_Disable;
                        ETH_InitStructure.ETH_ReceiveAll               = ETH_ReceiveAll_Disable;
                        ETH_InitStructure.ETH_BroadcastFramesReception = ETH_BroadcastFramesReception_Enable;
                        ETH_InitStructure.ETH_PromiscuousMode          = ETH_PromiscuousMode_Disable;
                        ETH_InitStructure.ETH_MulticastFramesFilter    = ETH_MulticastFramesFilter_Perfect;
                        ETH_InitStructure.ETH_UnicastFramesFilter      = ETH_UnicastFramesFilter_Perfect;
                        ETH_InitStructure.ETH_Speed                    = ETHMAC_SPEED;
                        if (ETHMAC_CHECKSUM_BY_HARDWARE != 0) {
                                ETH_InitStructure.ETH_ChecksumOffload  = ETH_ChecksumOffload_Enable;
                        }

                        /*
                         * Ethernet DMA configuration
                         * When we use the Checksum offload feature, we need to enable the Store and Forward mode:
                         * the store and forward guarantee that a whole frame is stored in the FIFO, so the MAC can
                         * insert/verify the checksum, if the checksum is OK the DMA can handle the frame otherwise
                         * the frame is dropped
                         */
                        ETH_InitStructure.ETH_DropTCPIPChecksumErrorFrame = ETH_DropTCPIPChecksumErrorFrame_Enable;
                        ETH_InitStructure.ETH_ReceiveStoreForward         = ETH_ReceiveStoreForward_Enable;
                        ETH_InitStructure.ETH_TransmitStoreForward        = ETH_TransmitStoreForward_Enable;
                        ETH_InitStructure.ETH_ForwardErrorFrames          = ETH_ForwardErrorFrames_Disable;
                        ETH_InitStructure.ETH_ForwardUndersizedGoodFrames = ETH_ForwardUndersizedGoodFrames_Disable;
                        ETH_InitStructure.ETH_SecondFrameOperate          = ETH_SecondFrameOperate_Enable;
                        ETH_InitStructure.ETH_AddressAlignedBeats         = ETH_AddressAlignedBeats_Enable;
                        ETH_InitStructure.ETH_FixedBurst                  = ETH_FixedBurst_Enable;
                        ETH_InitStructure.ETH_RxDMABurstLength            = ETH_RxDMABurstLength_32Beat;
                        ETH_InitStructure.ETH_TxDMABurstLength            = ETH_TxDMABurstLength_32Beat;
                        ETH_InitStructure.ETH_DMAArbitration              = ETH_DMAArbitration_RoundRobin_RxTx_2_1;

                        if (ETH_Init(&ETH_InitStructure, ETHMAC_PHY_ADDRESS))
                        {
                              ETH_DMAITConfig(ETH_DMA_IT_NIS | ETH_DMA_IT_R, ENABLE);
                              return STD_RET_OK;
                        }
                        errno = EIO;
                        break;

                case ETHMAC_IORQ_GET_RX_FLAG:
                        if (arg) {
                                *(bool *)arg = hdl->rx_data_ready;
                                return STD_RET_OK;
                        }
                        errno = EINVAL;
                        break;

                case ETHMAC_IORQ_CLEAR_RX_FLAG:
                        hdl->rx_data_ready = false;
                        return STD_RET_OK;

                case ETHMAC_IORQ_SET_MAC_ADR:
                        if (arg) {
                                u8_t *MAC = arg;
                                ETH_MACAddressConfig(ETH_MAC_Address0, MAC);
                                return STD_RET_OK;
                        }
                        errno = EINVAL;
                        break;

                case ETHMAC_IORQ_GET_RX_PACKET_SIZE:
                        if (arg) {
                                u32_t *packet_size = arg;
                                *packet_size = ETH_GetRxPktSize();
                                return STD_RET_OK;
                        }
                        errno = EINVAL;
                        break;

                case ETHMAC_IORQ_GET_RX_PACKET_CHAIN_MODE:
                        if (arg) {
                                struct ethmac_frame frame = {.length = 0, .buffer = NULL};

                                /* Check if the descriptor is owned by the ETHERNET DMA (when set) or CPU (when reset) */
                                if ((DMARxDescToGet->Status & ETH_DMARxDesc_OWN) != (u32) RESET) {
                                        frame.length = 0;

                                        if ((ETH->DMASR & ETH_DMASR_RBUS) != (u32) RESET) {
                                                /* Clear RBUS ETHERNET DMA flag */
                                                ETH->DMASR = ETH_DMASR_RBUS;

                                                /* Resume DMA reception */
                                                ETH->DMARPDR = 0;
                                        }

                                        *(struct ethmac_frame *)arg = frame;
                                        return STD_RET_OK;
                                }

