devdnl/dnx-rtos/src/system/drivers/ethmac/stm32f1/ethmac.c
                                if (  ((DMARxDescToGet->Status & ETH_DMARxDesc_ES) == (u32) RESET)
                                   && ((DMARxDescToGet->Status & ETH_DMARxDesc_LS) != (u32) RESET)
                                   && ((DMARxDescToGet->Status & ETH_DMARxDesc_FS) != (u32) RESET) ) {

                                        /* Get the Frame Length of the received packet: substruct 4 bytes of the CRC */
                                        frame.length = ((DMARxDescToGet->Status & ETH_DMARxDesc_FL) >> ETH_DMARxDesc_FrameLengthShift) - 4;

                                        /* Get the addrees of the actual buffer */
                                        frame.buffer = (u8_t *)DMARxDescToGet->Buffer1Addr;
                                } else {
                                        /* Return ERROR */
                                        frame.length = 0;
                                }

                                /* Set Own bit of the Rx descriptor Status: gives the buffer back to ETHERNET DMA */
                                DMARxDescToGet->Status = ETH_DMARxDesc_OWN;

                                /* Update the ETHERNET DMA global Rx descriptor with next Rx decriptor */
                                /* Chained Mode */
                                /* Selects the next DMA Rx descriptor list for next buffer to read */
                                DMARxDescToGet = (ETH_DMADESCTypeDef*) (DMARxDescToGet->Buffer2NextDescAddr);

                                *(struct ethmac_frame *)arg = frame;
                                return STD_RET_OK;
                        }
                        errno = EINVAL;
                        break;

                case ETHMAC_IORQ_GET_RX_BUFFER_UNAVAILABLE_STATUS:
                        if (arg) {
                                bool *status = arg;
                                if (ETH->DMASR & ETH_DMASR_RBUS)
                                        *status = true;
                                else
                                        *status = false;

                                return STD_RET_OK;
                        }
                        errno = EINVAL;
                        break;

                case ETHMAC_IORQ_CLEAR_RX_BUFFER_UNAVAILABLE_STATUS:
                        ETH->DMASR = ETH_DMASR_RBUS;
                        return STD_RET_OK;

                case ETHMAC_IORQ_RESUME_DMA_RECEPTION:
                        ETH->DMARPDR = 0;
                        return STD_RET_OK;

                case ETHMAC_IORQ_SET_TX_FRAME_LENGTH_CHAIN_MODE:
                        if (arg) {
                                u16_t frame_length = *(int*)arg;

                                /* Check if the descriptor is owned by the ETHERNET DMA (when set) or CPU (when reset) */
                                if ((DMATxDescToSet->Status & ETH_DMATxDesc_OWN) != (u32) RESET) {
                                        return STD_RET_ERROR;
                                } else {
                                        /* Setting the Frame Length: bits[12:0] */
                                        DMATxDescToSet->ControlBufferSize = (frame_length & ETH_DMATxDesc_TBS1);

                                        /* Setting the last segment and first segment bits (in this case a frame is transmitted in one descriptor) */
                                        DMATxDescToSet->Status |= ETH_DMATxDesc_LS | ETH_DMATxDesc_FS;

                                        /* Set Own bit of the Tx descriptor Status: gives the buffer back to ETHERNET DMA */
                                        DMATxDescToSet->Status |= ETH_DMATxDesc_OWN;

                                        /* When Tx Buffer unavailable flag is set: clear it and resume transmission */
                                        if ((ETH->DMASR & ETH_DMASR_TBUS) != (u32) RESET) {
                                                /* Clear TBUS ETHERNET DMA flag */
                                                ETH->DMASR = ETH_DMASR_TBUS;

                                                /* Resume DMA transmission*/
                                                ETH->DMATPDR = 0;
                                        }

                                        /* Update the ETHERNET DMA global Tx descriptor with next Tx decriptor */
                                        /* Chained Mode */
                                        /* Selects the next DMA Tx descriptor list for next buffer to send */
                                        DMATxDescToSet = (ETH_DMADESCTypeDef*) (DMATxDescToSet->Buffer2NextDescAddr);

                                        return STD_RET_OK;
                                }
                        }
                        errno = EINVAL;
                        break;

                case ETHMAC_IORQ_GET_CURRENT_TX_BUFFER:
                        if (arg) {
                                u8_t **buffer = arg;

                                *buffer = (u8_t*)DMATxDescToSet->Buffer1Addr;

                                return STD_RET_OK;
                        }
                        errno = EINVAL;
                        break;

                case ETHMAC_IORQ_INIT_DMA_TX_DESC_LIST_CHAIN_MODE:
                        if (arg) {
                                struct ethmac_DMA_description DMA_desc = *(struct ethmac_DMA_description *)arg;
                                eth_mem->tx_buffer_count       = DMA_desc.buffer_count;
                                eth_mem->DMA_tx_descriptor_tab = malloc(sizeof(ETH_DMADESCTypeDef) * eth_mem->tx_buffer_count);

                                if (eth_mem->DMA_tx_descriptor_tab) {
                                        ETH_DMATxDescChainInit(eth_mem->DMA_tx_descriptor_tab,
                                                               DMA_desc.buffer,
                                                               eth_mem->tx_buffer_count);

                                        return STD_RET_OK;
                                }
                        } else {
                                errno = EINVAL;
                        }
                        break;

                case ETHMAC_IORQ_INIT_DMA_RX_DESC_LIST_CHAIN_MODE:
                        if (arg) {
                                struct ethmac_DMA_description DMA_desc = *(struct ethmac_DMA_description *)arg;
                                eth_mem->rx_buffer_count       = DMA_desc.buffer_count;
                                eth_mem->DMA_rx_descriptor_tab = malloc(sizeof(ETH_DMADESCTypeDef) * eth_mem->rx_buffer_count);

                                if (eth_mem->DMA_rx_descriptor_tab) {
                                        ETH_DMARxDescChainInit(eth_mem->DMA_rx_descriptor_tab,
                                                               DMA_desc.buffer,
                                                               eth_mem->rx_buffer_count);

