devdnl/dnx-rtos/src/system/drivers/ethmac/stm32f1/ethmac.c
                                        return STD_RET_OK;
                                }
                        } else {
                                errno = EINVAL;
                        }
                        break;

                case ETHMAC_IORQ_ENABLE_RX_IRQ:
                        if (eth_mem->DMA_rx_descriptor_tab != NULL) {
                                for (uint i = 0; i < eth_mem->rx_buffer_count; i++) {
                                        ETH_DMARxDescReceiveITConfig(&eth_mem->DMA_rx_descriptor_tab[i], ENABLE);
                                }

                                return STD_RET_OK;
                        }
                        errno = EINVAL;
                        break;

                case ETHMAC_IORQ_ENABLE_TX_HARDWARE_CHECKSUM:
                        if (eth_mem->DMA_tx_descriptor_tab != NULL) {
                                for (uint i = 0; i < eth_mem->tx_buffer_count; i++) {
                                        ETH_DMATxDescChecksumInsertionConfig(&eth_mem->DMA_tx_descriptor_tab[i],
                                                                             ETH_DMATxDesc_ChecksumTCPUDPICMPFull);
                                }

                                return STD_RET_OK;
                        }
                        errno = EINVAL;
                        break;

                case ETHMAC_IORQ_ETHERNET_START:
                        ETH_Start();
                        return STD_RET_OK;

                case ETHMAC_IORQ_ETHERNET_DEINIT:
                        ETH_DeInit();
                        ETH_SoftwareReset();
                        while (ETH_GetSoftwareResetStatus() == SET);
                        break;

                default:
                        errno = EBADRQC;
                }
        } else {
                errno = EBUSY;
        }

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_FLUSH(ETHMAC, void *device_handle)
{
        STOP_IF(!device_handle);

        struct eth_mem *hdl = device_handle;

        if (device_is_access_granted(&hdl->dev_lock)) {
                ETH_FlushTransmitFIFO();
        } else {
                errno = EBUSY;
        }

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_STAT(ETHMAC, void *device_handle, struct vfs_dev_stat *device_stat)
{
        STOP_IF(!device_handle);
        STOP_IF(!device_stat);

        device_stat->st_size  = 0;
        device_stat->st_major = _ETHMAC_MAJOR_NUMBER;
        device_stat->st_minor = _ETHMAC_MINOR_NUMBER;

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Ethernet interrupt
 */
//==============================================================================
void ETH_IRQHandler(void)
{
      eth_mem->rx_data_ready = true;
      ETH_DMAClearITPendingBit(ETH_DMA_IT_R);
      ETH_DMAClearITPendingBit(ETH_DMA_IT_NIS);
}

/*==============================================================================
  End of file
==============================================================================*/
